testTutorials/2Dhysteresis/case/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# Preprocessing
rm -rf 0 && cp -r 0.org 0 
runApplication blockMesh
runApplication checkMesh

# Initialization
runApplication setAlphaField

# Postprocessing

runApplication decomposePar
#------------------------------------------------------------------------------

